STMicroelectronics/stm32-mw-ipl/Src/stats.c
                        for (int y = roi->y, yy = roi->y + roi->h; y < yy; y++) {
                            uint16_t *row_ptr = IMAGE_COMPUTE_RGB565_PIXEL_ROW_PTR(ptr, y), *other_row_ptr = IMAGE_COMPUTE_RGB565_PIXEL_ROW_PTR(other, y);
                            for (int x = roi->x, xx = roi->x + roi->w; x < xx; x++) {
                                int pixel = IMAGE_GET_RGB565_PIXEL_FAST(row_ptr, x), other_pixel = IMAGE_GET_RGB565_PIXEL_FAST(other_row_ptr, x);
                                int r = abs(COLOR_RGB565_TO_R5(pixel) - COLOR_RGB565_TO_R5(other_pixel));
                                int g = abs(COLOR_RGB565_TO_G6(pixel) - COLOR_RGB565_TO_G6(other_pixel));
                                int b = abs(COLOR_RGB565_TO_B5(pixel) - COLOR_RGB565_TO_B5(other_pixel));
                                pixel = COLOR_R5_G6_B5_TO_RGB565(r, g, b);
                                if (COLOR_THRESHOLD_RGB565(pixel, &lnk_data, invert)) {
                                    ((uint32_t *) out->LBins)[fast_roundf((COLOR_RGB565_TO_L(pixel) - COLOR_L_MIN) * l_mult)]++; // needs to be roundf
                                    ((uint32_t *) out->ABins)[fast_roundf((COLOR_RGB565_TO_A(pixel) - COLOR_A_MIN) * a_mult)]++; // needs to be roundf
                                    ((uint32_t *) out->BBins)[fast_roundf((COLOR_RGB565_TO_B(pixel) - COLOR_B_MIN) * b_mult)]++; // needs to be roundf
                                    pixel_count++;
                                }
                            }
                        }
                    }
                }
            }

            float pixels = IM_DIV(1, ((float) pixel_count));

            for (int i = 0, j = out->LBinCount; i < j; i++) {
                out->LBins[i] = ((uint32_t *) out->LBins)[i] * pixels;
            }

            for (int i = 0, j = out->ABinCount; i < j; i++) {
                out->ABins[i] = ((uint32_t *) out->ABins)[i] * pixels;
            }

            for (int i = 0, j = out->BBinCount; i < j; i++) {
                out->BBins[i] = ((uint32_t *) out->BBins)[i] * pixels;
            }

            break;
        }
        case IMAGE_BPP_RGB888: { // STM32IPL
            memset(out->LBins, 0, out->LBinCount * sizeof(uint32_t));
            memset(out->ABins, 0, out->ABinCount * sizeof(uint32_t));
            memset(out->BBins, 0, out->BBinCount * sizeof(uint32_t));

            int pixel_count = roi->w * roi->h;
            float l_mult = (out->LBinCount - 1) / ((float) (COLOR_L_MAX - COLOR_L_MIN));
            float a_mult = (out->ABinCount - 1) / ((float) (COLOR_A_MAX - COLOR_A_MIN));
            float b_mult = (out->BBinCount - 1) / ((float) (COLOR_B_MAX - COLOR_B_MIN));

            if ((!thresholds) || (!list_size(thresholds))) {
                // Fast histogram code when no color thresholds list...
                if (!other) {
                    for (int y = roi->y, yy = roi->y + roi->h; y < yy; y++) {
                        rgb888_t *row_ptr = IMAGE_COMPUTE_RGB888_PIXEL_ROW_PTR(ptr, y);
                        for (int x = roi->x, xx = roi->x + roi->w; x < xx; x++) {
                            rgb888_t pixel = IMAGE_GET_RGB888_PIXEL_FAST(row_ptr, x);
                            ((uint32_t *) out->LBins)[fast_roundf((COLOR_RGB888_TO_L(pixel) - COLOR_L_MIN) * l_mult)]++; // needs to be roundf
                            ((uint32_t *) out->ABins)[fast_roundf((COLOR_RGB888_TO_A(pixel) - COLOR_A_MIN) * a_mult)]++; // needs to be roundf
                            ((uint32_t *) out->BBins)[fast_roundf((COLOR_RGB888_TO_B(pixel) - COLOR_B_MIN) * b_mult)]++; // needs to be roundf
                        }
                    }
                } else {
                    for (int y = roi->y, yy = roi->y + roi->h; y < yy; y++) {
                    	rgb888_t *row_ptr = IMAGE_COMPUTE_RGB888_PIXEL_ROW_PTR(ptr, y), *other_row_ptr = IMAGE_COMPUTE_RGB888_PIXEL_ROW_PTR(other, y);
                        for (int x = roi->x, xx = roi->x + roi->w; x < xx; x++) {
                            rgb888_t pixel888 = IMAGE_GET_RGB888_PIXEL_FAST(row_ptr, x), other_pixel888 = IMAGE_GET_RGB888_PIXEL_FAST(other_row_ptr, x);
                            int r = abs(pixel888.r - other_pixel888.r);
                            int g = abs(pixel888.g - other_pixel888.g);
                            int b = abs(pixel888.b - other_pixel888.b);
                            pixel888.r = r;
                            pixel888.g = g;
                            pixel888.b = b;
                            ((uint32_t *) out->LBins)[fast_roundf((COLOR_RGB888_TO_L(pixel888) - COLOR_L_MIN) * l_mult)]++; // needs to be roundf
                            ((uint32_t *) out->ABins)[fast_roundf((COLOR_RGB888_TO_A(pixel888) - COLOR_A_MIN) * a_mult)]++; // needs to be roundf
                            ((uint32_t *) out->BBins)[fast_roundf((COLOR_RGB888_TO_B(pixel888) - COLOR_B_MIN) * b_mult)]++; // needs to be roundf
                        }
                    }
                }
            } else {
                // Reset pixel count.
                pixel_count = 0;
                if (!other) {
                    for (list_lnk_t *it = iterator_start_from_head(thresholds); it; it = iterator_next(it)) {
                        color_thresholds_list_lnk_data_t lnk_data;
                        iterator_get(thresholds, it, &lnk_data);

                        for (int y = roi->y, yy = roi->y + roi->h; y < yy; y++) {
                            rgb888_t *row_ptr = IMAGE_COMPUTE_RGB888_PIXEL_ROW_PTR(ptr, y);
                            for (int x = roi->x, xx = roi->x + roi->w; x < xx; x++) {
                            	rgb888_t pixel888 = IMAGE_GET_RGB888_PIXEL_FAST(row_ptr, x);
                                if (COLOR_THRESHOLD_RGB888(pixel888, &lnk_data, invert)) {
                                    ((uint32_t *) out->LBins)[fast_roundf((COLOR_RGB888_TO_L(pixel888) - COLOR_L_MIN) * l_mult)]++; // needs to be roundf
                                    ((uint32_t *) out->ABins)[fast_roundf((COLOR_RGB888_TO_A(pixel888) - COLOR_A_MIN) * a_mult)]++; // needs to be roundf
                                    ((uint32_t *) out->BBins)[fast_roundf((COLOR_RGB888_TO_B(pixel888) - COLOR_B_MIN) * b_mult)]++; // needs to be roundf
                                    pixel_count++;
                                }
                            }
                        }
                    }
                } else {
                    for (list_lnk_t *it = iterator_start_from_head(thresholds); it; it = iterator_next(it)) {
                        color_thresholds_list_lnk_data_t lnk_data;
                        iterator_get(thresholds, it, &lnk_data);

