STMicroelectronics/stm32-mw-ipl/Src/stats.c
                    int mx = get_median(x_histogram, blob_pixels, ptr->w); // Output doesn't need adjustment.
                    int my = get_median(y_histogram, blob_pixels, ptr->h); // Output doesn't need adjustment.
                    int mdx = get_median_l(x_delta_histogram, delta_sum, 2 * ptr->w) - ptr->w; // Fix offset.
                    int mdy = get_median_l(y_delta_histogram, delta_sum, 2 * ptr->h) - ptr->h; // Fix offset.

                    float rotation = (mdx ? fast_atan2f(mdy, mdx) : 1.570796f) + 1.570796f; // PI/2

                    out->theta = fast_roundf(rotation * 57.295780) % 180; // * (180 / PI)
                    if (out->theta < 0) out->theta += 180;
                    out->rho = fast_roundf(((mx - roi->x) * cos_table[out->theta]) + ((my - roi->y) * sin_table[out->theta]));

                    out->magnitude = fast_roundf(fast_sqrtf((mdx * mdx) + (mdy * mdy)));

                    if ((45 <= out->theta) && (out->theta < 135)) {
                        // y = (r - x cos(t)) / sin(t)
                        out->line.x1 = 0;
                        out->line.y1 = fast_roundf((out->rho - (out->line.x1 * cos_table[out->theta])) / sin_table[out->theta]);
                        out->line.x2 = roi->w - 1;
                        out->line.y2 = fast_roundf((out->rho - (out->line.x2 * cos_table[out->theta])) / sin_table[out->theta]);
                    } else {
                        // x = (r - y sin(t)) / cos(t);
                        out->line.y1 = 0;
                        out->line.x1 = fast_roundf((out->rho - (out->line.y1 * sin_table[out->theta])) / cos_table[out->theta]);
                        out->line.y2 = roi->h - 1;
                        out->line.x2 = fast_roundf((out->rho - (out->line.y2 * sin_table[out->theta])) / cos_table[out->theta]);
                    }

                    if(lb_clip_line(&out->line, 0, 0, roi->w, roi->h)) {
                        out->line.x1 += roi->x;
                        out->line.y1 += roi->y;
                        out->line.x2 += roi->x;
                        out->line.y2 += roi->y;
                        // Move rho too.
                        out->rho += fast_roundf((roi->x * cos_table[out->theta]) + (roi->y * sin_table[out->theta]));
                        result = true;
                    } else {
                        memset(out, 0, sizeof(find_lines_list_lnk_data_t));
                    }
                }
            }
        }

        fb_free(); // points
        fb_free(); // y_delta_histogram
        fb_free(); // x_delta_histogram
        fb_free(); // y_histogram
        fb_free(); // x_histogram
    }

    return result;
}

/**
 * @brief Computes a linear regression using points.
 * The linear regression is computed using least-squares normally which is fast but cannot handle any outliers.
 * If robust is True then the Theil-Sen linear regression is used instead which computes the median of all slopes between all thresholded pixels in the image
 * @param out		output and contains find_lines_list_lnk_data with the line points, magnitude.
 * @param points	points used in the regression
 * @param nPoints	number of first points used to find line with the regression
 * @param robust	is True then the Theil-Sen linear regression is used instead which computes the median of all slopes between all thresholded pixels in the image.
 * @return	stm32ipl_err_Ok on success, error otherwise
 */
stm32ipl_err_t STM32Ipl_GetRegressionPoints(find_lines_list_lnk_data_t *out, const point_t *points, uint16_t nPoints, bool robust)
{
	if (!out || !points )
		return stm32ipl_err_InvalidParameter;

	bool res = false;

	// FIXME: da sistemare


//    bool result = false;
    memset(out, 0, sizeof(find_lines_list_lnk_data_t));
    uint32_t max_x = 0;
    uint32_t max_y = 0;
    uint32_t min_x = 0;
    uint32_t min_y = 0;

    if (!robust) { // Least Squares
        int blob_pixels = 0;
        int blob_cx = 0;
        int blob_cy = 0;
        long long blob_a = 0;
        long long blob_b = 0;
        long long blob_c = 0;

        for (int i = 0; i< nPoints; i++) {
            blob_pixels += 1;
            blob_cx += points[i].x;
            blob_cy += points[i].y;
            blob_a += points[i].x*points[i].x;
            blob_b += points[i].x*points[i].y;
            blob_c += points[i].y*points[i].y;
            max_x = IM_MAX(max_x,points[i].x);
            max_y = IM_MAX(max_y,points[i].y);
            min_x = IM_MIN(min_x,points[i].x);
            min_y = IM_MIN(min_y,points[i].y);
        }

		// http://www.cse.usf.edu/~r1k/MachineVisionBook/MachineVision.files/MachineVision_Chapter2.pdf
		// https://www.strchr.com/standard_deviation_in_one_pass
		//
		// a = sigma(x*x) + (mx*sigma(x)) + (mx*sigma(x)) + (sigma()*mx*mx)
		// b = sigma(x*y) + (mx*sigma(y)) + (my*sigma(x)) + (sigma()*mx*my)
		// c = sigma(y*y) + (my*sigma(y)) + (my*sigma(y)) + (sigma()*my*my)
		//
		// blob_a = sigma(x*x)
		// blob_b = sigma(x*y)
		// blob_c = sigma(y*y)
		// blob_cx = sigma(x)
		// blob_cy = sigma(y)
		// blob_pixels = sigma()

		int mx = blob_cx / blob_pixels; // x centroid
		int my = blob_cy / blob_pixels; // y centroid
		int small_blob_a = blob_a - ((mx * blob_cx) + (mx * blob_cx)) + (blob_pixels * mx * mx);
		int small_blob_b = blob_b - ((mx * blob_cy) + (my * blob_cx)) + (blob_pixels * mx * my);
		int small_blob_c = blob_c - ((my * blob_cy) + (my * blob_cy)) + (blob_pixels * my * my);

		float rotation = ((small_blob_a != small_blob_c) ? (fast_atan2f(2 * small_blob_b, small_blob_a - small_blob_c) / 2.0f) : 1.570796f) + 1.570796f; // PI/2

		out->theta = fast_roundf(rotation * 57.295780) % 180; // * (180 / PI)
		if (out->theta < 0) out->theta += 180;
		//out->rho = fast_roundf(((mx) * cos_table[out->theta]) + ((my) * sin_table[out->theta]));
		out->rho = fast_roundf(((mx - min_x) * cos_table[out->theta]) + ((my - min_y) * sin_table[out->theta]));

		float part0 = (small_blob_a + small_blob_c) / 2.0f;
		float f_b = (float) small_blob_b;
		float f_a_c = (float) (small_blob_a - small_blob_c);
		float part1 = fast_sqrtf((4 * f_b * f_b) + (f_a_c * f_a_c)) / 2.0f;
		float p_add = fast_sqrtf(part0 + part1);
		float p_sub = fast_sqrtf(part0 - part1);
		float e_min = IM_MIN(p_add, p_sub);
		float e_max = IM_MAX(p_add, p_sub);
		out->magnitude = fast_roundf(e_max / e_min) - 1; // Circle -> [0, INF) -> Line

