STMicroelectronics/stm32-mw-ipl/Src/stats.c
		if ((45 <= out->theta) && (out->theta < 135)) {
			// y = (r - x cos(t)) / sin(t)
			out->line.x1 = 0;
			out->line.y1 = fast_roundf((out->rho - (out->line.x1 * cos_table[out->theta])) / sin_table[out->theta]);
			out->line.x2 = max_x - 1;
			out->line.y2 = fast_roundf((out->rho - (out->line.x2 * cos_table[out->theta])) / sin_table[out->theta]);
		} else {
			// x = (r - y sin(t)) / cos(t);
			out->line.y1 = 0;
			out->line.x1 = fast_roundf((out->rho - (out->line.y1 * sin_table[out->theta])) / cos_table[out->theta]);
			out->line.y2 = max_y - 1;
			out->line.x2 = fast_roundf((out->rho - (out->line.y2 * sin_table[out->theta])) / cos_table[out->theta]);
		}

		if(lb_clip_line(&out->line, min_x, min_y, max_x, max_y)) {
			out->line.x1 += 0;
			out->line.y1 += 0;
			out->line.x2 += 0;
			out->line.y2 += 0;
			// Move rho too.
			//out->rho += fast_roundf((cos_table[out->theta]) + (sin_table[out->theta]));
			out->rho += fast_roundf((min_x * cos_table[out->theta]) + (min_y * sin_table[out->theta]));
			res = true;
		} else {
			memset(out, 0, sizeof(find_lines_list_lnk_data_t));
		}
    } else { // Theil-Sen Estimator

        for (int i = 0; i< nPoints; i++){

        	max_x = IM_MAX(max_x,points[i].x);
            max_y = IM_MAX(max_y,points[i].y);
            min_x = IM_MIN(min_x,points[i].x);
            min_y = IM_MIN(min_y,points[i].y);
        }

        int *x_histogram = fb_alloc0(max_x * sizeof(int), FB_ALLOC_NO_HINT); // Not roi so we don't have to adjust, we can burn the RAM.
        int *y_histogram = fb_alloc0(max_y * sizeof(int), FB_ALLOC_NO_HINT); // Not roi so we don't have to adjust, we can burn the RAM.

        long long *x_delta_histogram = fb_alloc0((2 * max_x) * sizeof(long long), FB_ALLOC_NO_HINT); // Not roi so we don't have to adjust, we can burn the RAM.
        long long *y_delta_histogram = fb_alloc0((2 * max_y) * sizeof(long long), FB_ALLOC_NO_HINT); // Not roi so we don't have to adjust, we can burn the RAM.

        uint32_t size = nPoints*sizeof(point_t);
        point_t *points = (point_t *) fb_alloc(size, FB_ALLOC_NO_HINT);

        size_t points_max = size / sizeof(point_t);
        size_t points_count = 0;

        if(points_max) {
            int blob_pixels = 0;

            for (int i = 0; i< nPoints; i++){
                blob_pixels += 1;
                x_histogram[points[i].x]++;
                y_histogram[points[i].y]++;

                if(points_count < points_max) {
                    point_init(&points[points_count], points[i].x, points[i].y);
                    points_count += 1;
                }

            }

			long long delta_sum = (points_count * (points_count - 1)) / 2;

			if (delta_sum) {
				// The code below computes the average slope between all pairs of points.
				// This is a N^2 operation that can easily blow up if the image is not threshold carefully...

				for(int i = 0; i < points_count; i++) {
					point_t *p0 = &points[i];
					for(int j = i + 1; j < points_count; j++) {
						point_t *p1 = &points[j];
						x_delta_histogram[p0->x - p1->x + max_x]++; // Note we allocated 1 extra above so we can do points->w instead of (points->w-1).
						y_delta_histogram[p0->y - p1->y + max_y]++; // Note we allocated 1 extra above so we can do points->h instead of (points->h-1).
					}
				}

				int mx = get_median(x_histogram, blob_pixels, max_x); // Output doesn't need adjustment.
				int my = get_median(y_histogram, blob_pixels, max_y); // Output doesn't need adjustment.
				int mdx = get_median_l(x_delta_histogram, delta_sum, 2 * max_x) - max_x; // Fix offset.
				int mdy = get_median_l(y_delta_histogram, delta_sum, 2 * max_y) - max_y; // Fix offset.

				float rotation = (mdx ? fast_atan2f(mdy, mdx) : 1.570796f) + 1.570796f; // PI/2

				out->theta = fast_roundf(rotation * 57.295780) % 180; // * (180 / PI)
				if (out->theta < 0) out->theta += 180;
				out->rho = fast_roundf(((mx - min_x) * cos_table[out->theta]) + ((my - min_y) * sin_table[out->theta]));

				out->magnitude = fast_roundf(fast_sqrtf((mdx * mdx) + (mdy * mdy)));

				if ((45 <= out->theta) && (out->theta < 135)) {
					// y = (r - x cos(t)) / sin(t)
					out->line.x1 = 0;
					out->line.y1 = fast_roundf((out->rho - (out->line.x1 * cos_table[out->theta])) / sin_table[out->theta]);
					out->line.x2 = max_x;
					out->line.y2 = fast_roundf((out->rho - (out->line.x2 * cos_table[out->theta])) / sin_table[out->theta]);
				} else {
					// x = (r - y sin(t)) / cos(t);
					out->line.y1 = 0;
					out->line.x1 = fast_roundf((out->rho - (out->line.y1 * sin_table[out->theta])) / cos_table[out->theta]);
					out->line.y2 = max_y;
					out->line.x2 = fast_roundf((out->rho - (out->line.y2 * sin_table[out->theta])) / cos_table[out->theta]);
				}

				if(lb_clip_line(&out->line, min_x, min_y, max_x, max_y)) {
					out->line.x1 += 0;
					out->line.y1 += 0;
					out->line.x2 += 0;
					out->line.y2 += 0;
					// Move rho too.
					out->rho += fast_roundf((min_x * cos_table[out->theta]) + (min_y * sin_table[out->theta]));
					res = true;
				} else {
					memset(out, 0, sizeof(find_lines_list_lnk_data_t));
				}
			}
        }

        fb_free(); // points
        fb_free(); // y_delta_histogram
        fb_free(); // x_delta_histogram
        fb_free(); // y_histogram
        fb_free(); // x_histogram
    }

    return res ? stm32ipl_err_Ok : stm32ipl_err_OpNotCompleted;
}
